# клонирование-создание удаленного репозитория для собственного пользователя
# форк - легальная кража
# индекс-структура данных которая хранит информацию о том какие файлы будут включены в следующий комит
# откат(реверт)-процесс отмены изминений сделанных в определенном комите
#  -репозиторий который рассположен на удаленном сервере и доступен
# пул запрос -запрос на внесение изминений в оригинальный репозиторий
# история комитов - список  всех комитов сделанных репозиториев в хронологическом порядке
# тег - ссылка на кокретный комит
# сташ  - временное хранилище изминений которые не готовы к комитуda
# гит игнор - файл который указывает гид какие файлы надо игнорировать
# саб модуль - отдельный репозиторий который используется как подмодуль для основного репозитория
# print(123)
f"В консоли" \
f"git init - новый репозиторий git" \
f"git clone - клонирование существующего репозитория" \
f"git add - добавление определенного файла" \
f"git add. - добавление всех файлов" \
f"git comit -m название комита"
f"git push - отправка комитов в репозитории" \
f"!!!!git pull - получение обновление из удаленного репозитория" \
f"git diff Названиефайла - просмотр изминений в файле" \
f"git status - просмотр списка измененных файлов" \
f"git btanch - создание новой ветки" \
f"git checkout - переключение на другую ветку" \
f"git branch название ветки- удаление ветки" \
f"git log - просмотр истории комитов"