# клонирование-создание удаленного репозитория для собственного пользователя
# форк - легальная кража
# индекс-структура данных которая хранит информацию о том какие файлы будут включены в следующий комит
# откат(реверт)-процесс отмены изминений сделанных в определенном комите
#  -репозиторий который рассположен на удаленном сервере и доступен
# пул запрос -запрос на внесение изминений в оригинальный репозиторий
# история комитов - список  всех комитов сделанных репозиториев в хронологическом порядке
# тег - ссылка на кокретный комит
# сташ  - временное хранилище изминений которые не готовы к комитуda
# гит игнор - файл который указывает гид какие файлы надо игнорировать